In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Student_ID": [1, 2, 3],
    "Name": ["Ali", "Sara", "Ahmed"],
    "Math": [85, 90, 78],
    "Science": [88, 92, 80],
    "English": [75, 85, 82]
})

In [3]:
df

   Student_ID   Name  Math  Science  English
0           1    Ali    85       88       75
1           2   Sara    90       92       85
2           3  Ahmed    78       80       82

In [8]:
melted_data=df.melt(
    id_vars=["Student_ID","Name"],
    var_name="Subjects",
    value_name="Marks"
)

In [9]:
melted_data

   Student_ID   Name Subjects  Marks
0           1    Ali     Math     85
1           2   Sara     Math     90
2           3  Ahmed     Math     78
3           1    Ali  Science     88
4           2   Sara  Science     92
5           3  Ahmed  Science     80
6           1    Ali  English     75
7           2   Sara  English     85
8           3  Ahmed  English     82

In [16]:
melted_data.pivot(
    index=["Student_ID","Name"],
    columns="Subjects",
    values="Marks"
)

Subjects          English  Math  Science
Student_ID Name
1          Ali         75    85       88
2          Sara        85    90       92
3          Ahmed       82    78       80